doc/index.md
```mermaid
flowchart TD
    commands[ZeroInstall.Commands] --> services
    commands --> desktop_integration
    publish[ZeroInstall.Publish] --> client
    publish --> archives
    publish --> desktop_integration
    services[ZeroInstall.Services] --> archives
    archives[ZeroInstall.Archives] --> store
    desktop_integration[ZeroInstall.DesktopIntegration] --> store
    client[ZeroInstall.Client] --> model
    store[ZeroInstall.Store] --> model
    model[ZeroInstall.Model]
```
